##  4.6: Combining & Exporting Data - part2

In [1]:
#  Import the pandas, NumPy, and os libraries

import numpy as np
import pandas as pd
import os

In [2]:
# Paths to/from project folder

path_orig = r'C:\Users\kacor\CareerFoundry-Python\PROJECT - Instacart Basket Analysis\02 Data\Original Data'
path_prep = r'C:\Users\kacor\CareerFoundry-Python\PROJECT - Instacart Basket Analysis\02 Data\Prepared Data'

In [3]:
#  Import orders_products_combined (from 4-6 part1, from Prepared folder)

df_orders_products_combined = pd.read_pickle(os.path.join(path_prep, 'orders_products_combined_4-6.pkl'))

In [4]:
df_orders_products_combined.shape

(32434489, 10)

In [5]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,hour_order_was_placed,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [6]:
# Remove the _merge column

df_orders_products_combined = df_orders_products_combined.drop(columns=['_merge'])
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,hour_order_was_placed,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [7]:
df_orders_products_combined.shape

(32434489, 9)

In [8]:
#  Import cleaned products data set (products_cleaned_4-5 from Prepared folder)

df_prods = pd.read_csv(os.path.join(path_prep, 'products_cleaned_4-5.csv'), index_col = False)

In [9]:
df_prods.shape

(49672, 4)

In [10]:
df_prods.head()

,product_id,product_name,department_id,prices
0,1,Chocolate Sandwich Cookies,19,5.8
1,2,All-Seasons Salt,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,1,10.5
4,5,Green Chile Anytime Sauce,13,4.3

In [12]:
df_prods.shape

(49672, 4)

In [14]:
#  Merge the two data sets on the product_id column and generate the _merge column

df_merged_prods_orders = df_orders_products_combined.merge(df_prods, on = 'product_id', indicator = True)

In [15]:
df_merged_prods_orders.head()

,order_id,user_id,order_number,orders_day_of_week,hour_order_was_placed,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,7,9.0,both

In [16]:
df_merged_prods_orders.shape

(32404859, 13)

In [17]:
#  For the inner join of these two data frames, each row has entries from both data frames

df_merged_prods_orders['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [18]:
#  Export df_merged_large to Prepared folder in .pkl format  (name changed to ords_prods_merged_4-6)

df_merged_prods_orders.to_pickle(os.path.join(path_prep, 'ords_prods_merged_4-6.pkl'))